# На вход программе подается натуральное число n. Напишите программу, которая
# подсчитывает сумму тех чисел от 1 до n (включительно) квадрат которых
# оканчивается на 2,5 или 8.
#
# Формат входных данных
# На вход программе подается натуральное число n.
#
# Формат выходных данных
# Программа должна вывести единственное число в соответствии с условием задачи.
#
# Примечание. Если таких чисел нет в указанном диапазоне, то следует вывести 0.


n = int(input())
res = 0
for i in range(n + 1):
    if (i * i) % 10 == 2 or (i * i) % 10 == 5 or (i * i) % 10 == 8:
        res += i
print(res)
