# Напишите программу, которая считывает длины двух катетов в прямоугольном
# треугольнике и выводит его площадь.

a, b = float(input()), float(input())
S = 0.5 * a * b
print(S)
