# На вход программе подается строка текста в которой буква «h»
# встречается как минимум два раза. Напишите программу, которая возвращает
# исходную строку и переворачивает последовательность символов, заключенную
# между первым и последним вхождением буквы «h».
#
# Формат входных данных
# На вход программе подается строка текста.
#
# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.


s = input()
s_rotate = ''
start = s.find('h')
end = s.rfind('h')
s_rotate = s[start + 1:end]
print(s[:start + 1], s_rotate[::-1], s[end:], sep='')
